ka2_2024/src/DataProcessors/ИнтеграцияУправлениеПерсоналом/ИнтеграцияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияУправлениеПерсоналом</name>
</mdclass:DataProcessor>

ka2_2024/src/InformationRegisters/ВыгружаемыеОбъекты1СПерсонал/ВыгружаемыеОбъекты1СПерсонал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгружаемыеОбъекты1СПерсонал</name>
  <comment>Объекты, соответствующие правилам выгрузки</comment>
  <resources>
    <name>УсловноВыгружается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.СсылкаПубликации1СПерсонал</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/InformationRegisters/ВыгружаемыеОбъектыКабинетСотрудника/ВыгружаемыеОбъектыКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгружаемыеОбъектыКабинетСотрудника</name>
  <comment>Объекты, соответствующие правилам выгрузки</comment>
  <resources>
    <name>УсловноВыгружается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DefinedType.СсылкаПубликацииКабинетСотрудника</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Enums/ТипыОбъектовИнтеграцияУправлениеПерсоналом/ТипыОбъектовИнтеграцияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовИнтеграцияУправлениеПерсоналом</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Должность</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьПоШтатномуРасписанию</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ГрафикРаботы</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ВерсииФормата</name>
  </enumValues>
  <enumValues>
    <name>ВсеИзменения</name>
  </enumValues>
  <enumValues>
    <name>ВидПредоставляемойСотрудникамСправки</name>
  </enumValues>
  <enumValues>
    <name>Оффер</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеДоступаКРабочимКонтактам</name>
  </enumValues>
  <enumValues>
    <name>ДоступныеФункцииФизическогоЛица</name>
  </enumValues>
  <enumValues>
    <name>ДокументНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаПрисоединениеККЭДО</name>
  </enumValues>
  <enumValues>
    <name>МашиночитаемаяДоверенностьКЭДО</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНалоговыйВычет</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>Отсутствие</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаДСВ</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ЗаработанныеПраваНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ПрименяемыеВычетыНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ПраздничныеДниГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>РезультатСогласования</name>
  </enumValues>
  <enumValues>
    <name>ПравилоСогласования</name>
  </enumValues>
  <enumValues>
    <name>РасчетныйЛисток</name>
  </enumValues>
  <enumValues>
    <name>ПлановоеУдержание</name>
  </enumValues>
  <enumValues>
    <name>БудущееИзменениеОстаткаОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбИспользованииОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ВидСоставнойЧастиЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Справка2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>СправкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ИспользуемаяФункциональность</name>
  </enumValues>
  <enumValues>
    <name>НастройкиЗаявленийНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДоступностьПриложения</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ПриложенияДляИнтеграции/ПриложенияДляИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПриложенияДляИнтеграции</name>
  <enumValues>
    <name>УправлениеПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>КабинетСотрудника</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/DataProcessors/ИнтеграцияУправлениеПерсоналом/Forms/ОшибкиЗаполненияОбъектов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Приложение = Параметры.Приложение;
	Если Не ЗначениеЗаполнено(Приложение) Тогда
		Возврат;
	КонецЕсли;
	УстановитьТекстыЗапросов();
	
	ПоказыватьПозиции = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура");
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокОшибокЗаполненияИнтеграцияУправлениеПерсоналом" Тогда
		ОбновитьСписки();
	ИначеЕсли ИмяСобытия = "ИзмененаПубликуемаяСтруктураКомпании" Тогда 
		ОбновитьЭлементыФормы();
		ОбновитьСписки();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьЗаполнениеОбъектов(Команда)
	НачатьПроверкуЗаполнения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТекстыЗапросов()

	МенеджерТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом;
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ТекстЗапроса = Позиции.ТекстЗапроса;
	СтрокаПоиска = "Справочник.ШтатноеРасписание КАК ШтатноеРасписание"; 
	Если Приложение = Перечисления.ПриложенияДляИнтеграции.УправлениеПерсоналом Тогда
		СтрокаЗамены = "
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъекты1СПерсонал КАК ВыгружаемыеОбъекты
		|		ПО ШтатноеРасписание.Ссылка = ВыгружаемыеОбъекты.Ссылка";
	Иначе
		СтрокаЗамены = "
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
		|		ПО ШтатноеРасписание.Ссылка = ВыгружаемыеОбъекты.Ссылка";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,СтрокаПоиска,СтрокаЗамены);
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Позиции, СвойстваСписка);
	Позиции.Параметры.УстановитьЗначениеПараметра("ТипОбъекта", МенеджерТипОбъекта.ДолжностьПоШтатномуРасписанию);
	Позиции.Параметры.УстановитьЗначениеПараметра("Приложение", Приложение);
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ТекстЗапроса = Сотрудники.ТекстЗапроса;
	СтрокаПоиска = "Справочник.Сотрудники КАК СправочникСотрудники"; 
	Если Приложение = Перечисления.ПриложенияДляИнтеграции.УправлениеПерсоналом Тогда
		СтрокаЗамены = "
		|	Справочник.Сотрудники КАК СправочникСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъекты1СПерсонал КАК ВыгружаемыеОбъекты
		|		ПО СправочникСотрудники.Ссылка = ВыгружаемыеОбъекты.Ссылка";
	Иначе
		СтрокаЗамены = "
		|	Справочник.Сотрудники КАК СправочникСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
		|		ПО СправочникСотрудники.Ссылка = ВыгружаемыеОбъекты.Ссылка";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,СтрокаПоиска,СтрокаЗамены);
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Сотрудники, СвойстваСписка);
	Сотрудники.Параметры.УстановитьЗначениеПараметра("ТипОбъекта", МенеджерТипОбъекта.Сотрудник); 
	Сотрудники.Параметры.УстановитьЗначениеПараметра("Приложение", Приложение);
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ТекстЗапроса = ФизическиеЛица.ТекстЗапроса;
	СтрокаПоиска = "Справочник.ФизическиеЛица КАК ФизическиеЛица"; 
	Если Приложение = Перечисления.ПриложенияДляИнтеграции.УправлениеПерсоналом Тогда
		СтрокаЗамены = "
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъекты1СПерсонал КАК ВыгружаемыеОбъекты
		|		ПО ФизическиеЛица.Ссылка = ВыгружаемыеОбъекты.Ссылка";
	Иначе
		СтрокаЗамены = "
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
		|		ПО ФизическиеЛица.Ссылка = ВыгружаемыеОбъекты.Ссылка";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,СтрокаПоиска,СтрокаЗамены);
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ФизическиеЛица, СвойстваСписка);
	ФизическиеЛица.Параметры.УстановитьЗначениеПараметра("ТипОбъекта", МенеджерТипОбъекта.ФизическоеЛицо);
	ФизическиеЛица.Параметры.УстановитьЗначениеПараметра("Приложение", Приложение);

КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуЗаполнения()

	ДлительнаяОперация = ДлительнаяОперацияПроверкаЗаполнения();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Проверка заполнения объектов выполнена.'");
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверкаЗаполненияЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПроверкаЗаполнения()

	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания", НСтр("ru = 'Проверка заполнения объектов'"));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ПараметрыПроцедуры = Новый Структура("Приложение", Приложение);
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияУправлениеПерсоналом.ПроверитьЗаполнениеОбъектовПриложенияФоновоеЗадание",
		ПараметрыПроцедуры,
		ПараметрыВыполненияВФоне);

КонецФункции

&НаКлиенте
Процедура ПроверкаЗаполненияЗавершение(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОбновитьСписки();
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки()
	
	Элементы.ФизическиеЛица.Обновить();
	Элементы.Сотрудники.Обновить();
	Если Элементы.СтраницаПозиции.Видимость Тогда
		Элементы.Позиции.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()

	Показывать = ПоказыватьПозиции И Не ИнтеграцияУправлениеПерсоналом.ПубликоватьСтруктуруЮридическихЛиц();
	Элементы.СтраницаПозиции.Видимость 		= Показывать;
	Элементы.СотрудникиПозицияШР.Видимость 	= Показывать;

КонецПроцедуры

#КонецОбласти
